# Data Cleansing

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.read_csv(r"Open_Sooq.csv")
df1.head()

,Property Title,Location,Bedrooms,Price,Size,Listing Type
0,115 m2 2 Bedrooms Apartments for Rent in Dhofa...,"Dhofar, Salala",2.0,45 OMR,115.0,For Rent
1,Furnished Daily in Dhofar Salala,"Dhofar, Salala",NaN,15 OMR,NaN,For Rent
2,900 m2 2 Bedrooms Apartments for Rent in Dhofa...,"Dhofar, Salala",2.0,25 OMR,900.0,For Rent
3,More than 6 bedrooms Chalet for Rent in Al Bat...,"Al Batinah, Suwaiq",NaN,70 OMR,5000.0,For Rent
4,60 m2 1 Bedroom Apartments for Rent in Dhofar ...,"Dhofar, Salala",1.0,45 OMR,60.0,For Rent

In [3]:
df2 = pd.read_csv(r"Hilal.csv")
df2.head()

        Property Title         Location Bedrooms  Price Size Listing Type
0      4-BEDROOM VILLA           Azaiba        4    500  NaN     For Rent
1          STUDIO FLAT          Bausher        1    270  NaN     For Rent
2      COMMERCIAL SHOP       Al Mawaleh      NaN    350   65     For Rent
3  2-BEDROOM APARTMENT         Al Ansab        2    300  NaN     For Rent
4  2-BEDROOM APARTMENT  Shatti Al Qurum        2    500  NaN     For Rent

In [4]:
merged_df = pd.concat([df1, df2], ignore_index = True)
merged_df.head()

,Property Title,Location,Bedrooms,Price,Size,Listing Type
0,115 m2 2 Bedrooms Apartments for Rent in Dhofa...,"Dhofar, Salala",2.0,45 OMR,115.0,For Rent
1,Furnished Daily in Dhofar Salala,"Dhofar, Salala",NaN,15 OMR,NaN,For Rent
2,900 m2 2 Bedrooms Apartments for Rent in Dhofa...,"Dhofar, Salala",2.0,25 OMR,900.0,For Rent
3,More than 6 bedrooms Chalet for Rent in Al Bat...,"Al Batinah, Suwaiq",NaN,70 OMR,5000.0,For Rent
4,60 m2 1 Bedroom Apartments for Rent in Dhofar ...,"Dhofar, Salala",1.0,45 OMR,60.0,For Rent

In [5]:
merged_df.to_csv("RealEstate_Dataset [Before Cleaning].csv", index = False)

In [6]:
merged_df.shape

(5566, 6)

In [7]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5566 entries, 0 to 5565
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Property Title  5566 non-null   object
 1   Location        5560 non-null   object
 2   Bedrooms        3216 non-null   object
 3   Price           5447 non-null   object
 4   Size            4265 non-null   object
 5   Listing Type    5566 non-null   object
dtypes: object(6)
memory usage: 261.0+ KB

In [8]:
merged_df.isnull().sum()

Property Title       0
Location             6
Bedrooms          2350
Price              119
Size              1301
Listing Type         0
dtype: int64

In [9]:
merged_df.duplicated().sum()

1385

In [10]:
merged_df.drop_duplicates(keep = "first", inplace = True)

In [11]:
merged_df.duplicated().sum()

0

In [12]:
merged_df.isnull().sum()

Property Title       0
Location             5
Bedrooms          1638
Price               81
Size               740
Listing Type         0
dtype: int64

In [13]:
merged_df.dropna(subset=["Location"], inplace=True)

In [14]:
merged_df.isnull().sum()

Property Title       0
Location             0
Bedrooms          1638
Price               81
Size               736
Listing Type         0
dtype: int64

In [ ]:
merged_df.isnull().sum()

In [16]:
merged_df["Price"].unique()

array(['45 OMR', '15 OMR', '25 OMR', '70 OMR', '210 OMR', '100 OMR',
       '800 OMR', '80 OMR', '220 OMR', '110 OMR', '180 OMR', '30 OMR',
       '60 OMR', '1,000 OMR', '50 OMR', '40 OMR', '120 OMR', '10 OMR',
       '75 OMR', '35 OMR', '20 OMR', '145 OMR', '300 OMR', '1 OMR',
       '150 OMR', '65 OMR', '85 OMR', '1,600 OMR', '2,300 OMR', '29 OMR',
       '6 OMR', '400 OMR', '90 OMR', '4 OMR', '24 OMR', '95 OMR',
       '105 OMR', '7 OMR', nan, '450 OMR', '9 OMR', '350,000 OMR',
       '160 OMR', '99 OMR', '190 OMR', '200 OMR', '550 OMR', '135 OMR',
       '27 OMR', '340 OMR', '28 OMR', '1,250 OMR', '240 OMR', '18 OMR',
       '17 OMR', '165 OMR', '8 OMR', '600 OMR', '55 OMR', '140 OMR',
       '950 OMR', '5 OMR', '385 OMR', '33 OMR', '130 OMR', '650 OMR',
       '35,000 OMR', '12 OMR', '14 OMR', '13 OMR', '58 OMR', '250 OMR',
       '900 OMR', '16 OMR', '425 OMR', '290 OMR', '3,700 OMR', '350 OMR',
       '570 OMR', '3,000 OMR', '125 OMR', '1,200 OMR', '225 OMR',
       '13,000 OMR', '390 OMR', '430 OMR', '460 OMR', '89 OMR', '11 OMR',
       '42 OMR', '1,700 OMR', '500 OMR', '700 OMR', '410 OMR', '675 OMR',
       '230 OMR', '320 OMR', '575 OMR', '109 OMR', '234 OMR', '199 OMR',
       '38 OMR', '1,050 OMR', '1,500 OMR', '850 OMR', '1,400 OMR',
       '530 OMR', '590 OMR', '280 OMR', '295 OMR', '170 OMR', '270 OMR',
       '22 OMR', '19 OMR', '48 OMR', '215 OMR', '2,000 OMR', '2,100 OMR',
       '185 OMR', '285 OMR', '23 OMR', '3 OMR', '260 OMR', '279 OMR',
       '72,000 OMR', '1,980 OMR', '625 OMR', '175 OMR', '330 OMR',
       '4,500 OMR', '1,100 OMR', '4,000 OMR', '800,000 OMR', '310 OMR',
       '25,000 OMR', '155 OMR', '370 OMR', '360 OMR', '5,000 OMR',
       '825 OMR', '725 OMR', '1,150 OMR', '255 OMR', '32 OMR',
       '160,000 OMR', '1,650 OMR', '1,800 OMR', '940 OMR', '380 OMR',
       '195 OMR', '750 OMR', '5,600 OMR', '5,500 OMR', '2,500 OMR',
       '57,000 OMR', '420 OMR', '1,850 OMR', '325 OMR', '2,900 OMR',
       '999 OMR', '121 OMR', '639 OMR', '357 OMR', '293 OMR', '235 OMR',
       '115 OMR', '10,000 OMR', '525 OMR', '3,840 OMR', '350,055 OMR',
       '347 OMR', '423 OMR', '189 OMR', '369 OMR', '79 OMR', '1,350 OMR',
       '98,225,514 OMR', '66 OMR', '600,000 OMR', '3,400 OMR', '485 OMR',
       '40,000 OMR', '2,250 OMR', '5,700 OMR', '11,000 OMR', '21 OMR',
       '1,750,000 OMR', '1,010 OMR', '180,000 OMR', '200,000 OMR',
       '620 OMR', '7,500 OMR', '1,300 OMR', '660 OMR', '440 OMR',
       '640 OMR', '272 OMR', '376 OMR', '863 OMR', '139 OMR', '556 OMR',
       '370,000 OMR', '170,000 OMR', '3,500 OMR', '20,000 OMR', '630 OMR',
       '4,300 OMR', '140,150,160 OMR', '100,000 OMR', '6,000 OMR',
       '480 OMR', '1,027 OMR', '275 OMR', '65,000 OMR', '7,000 OMR',
       '2 OMR', '15,000 OMR', '265 OMR', '12,000 OMR', '99,999 OMR',
       '1,380 OMR', '375 OMR', '2,208 OMR', '2,056 OMR', '44 OMR',
       '75,000 OMR', '2,200 OMR', '245 OMR', '159 OMR', '659 OMR',
       '196 OMR', '92 OMR', '149 OMR', '253 OMR', '299 OMR', '809 OMR',
       '329 OMR', '479 OMR', '912 OMR', '291 OMR', '102 OMR', '281 OMR',
       '112 OMR', '716 OMR', '997 OMR', '612 OMR', '4,800 OMR',
       '6,500 OMR', '475 OMR', '3,950 OMR', '5,530 OMR', '9,999 OMR',
       '395 OMR', '490 OMR', '9,000 OMR', '1,550 OMR', '540 OMR',
       '19,000 OMR', '546 OMR', '168 OMR', '414 OMR', '37 OMR',
       '1,064 OMR', '670 OMR', '3,717 OMR', '6,405 OMR', '378 OMR',
       '2,350 OMR', '60,000 OMR', '70,000 OMR', '1,179 OMR', '119 OMR',
       '1,000,000 OMR', '609 OMR', 500, 270, 350, 300, 1500, 370, 4, 650,
       6, 750, 7, 2200, 180, 250, 800, 400, 550, 1800, 675, 900, 1100,
       2500, 700, 600, 450, 560, 375, 1300, 1000, 850, 950, 330, 280,
       1600, 475, 360, 3000, 11000, 1350, 1400, 315, 515, 210, 11900,
       1200, 1750, 2300, 220, 230, 2100, 225, 150, 380, 7500, 320, 135,
       680, 200, -550, 33000, 1700, 5000, 2000, 2800, 4500, 145000, -950,
       -600], dtype=object)

In [17]:
merged_df["Price"] = merged_df["Price"].astype(str)
merged_df["Price"] = merged_df["Price"].replace({"OMR": "", ",": "", "-": ""}, regex=True)
merged_df["Price"] = merged_df["Price"].str.strip().str.split().str[0]

# Step 2: Convert to float
merged_df["Price"] = merged_df["Price"].astype(float)

# Step 3: Fill NaNs with mode
merged_df["Price"].fillna(merged_df["Price"].mode()[0], inplace=True)

C:\Users\bbuser\AppData\Local\Temp\ipykernel_23460\3492401443.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  merged_df["Price"].fillna(merged_df["Price"].mode()[0], inplace=True)

In [18]:
merged_df.isnull().sum()

Property Title       0
Location             0
Bedrooms          1638
Price                0
Size               736
Listing Type         0
dtype: int64

In [20]:
merged_df[["Price"]]

      Price
0      45.0
1      15.0
2      25.0
3      70.0
4      45.0
...     ...
5561  350.0
5562  950.0
5563  950.0
5564  475.0
5565  600.0

[4176 rows x 1 columns]

In [15]:
merged_df["Bedrooms"].unique()

array([2.0, nan, 1.0, 4.0, 3.0, 5.0, '4', '1', '2', '2,3,4', '5', '3',
       '7', '6', '8'], dtype=object)

In [21]:
# Step 1: Convert all values to string
merged_df['Bedrooms'] = merged_df['Bedrooms'].astype(str)

# Step 2: Extract the first number before a comma
merged_df['Bedrooms'] = merged_df['Bedrooms'].apply(lambda x: x.split(',')[0])

# Step 3: Convert to integer, coercing errors to NaN (in case of invalid data)
merged_df['Bedrooms'] = pd.to_numeric(merged_df['Bedrooms'], errors='coerce')

# Step 4: Fill null values with the mode (most frequent value)
mode_value = merged_df['Bedrooms'].mode()[0]
merged_df['Bedrooms'] = merged_df['Bedrooms'].fillna(mode_value).astype(int)

In [22]:
merged_df.isnull().sum()

Property Title      0
Location            0
Bedrooms            0
Price               0
Size              736
Listing Type        0
dtype: int64

In [23]:
merged_df[["Bedrooms"]]

      Bedrooms
0            2
1            2
2            2
3            2
4            1
...        ...
5561         2
5562         4
5563         6
5564         2
5565         4

[4176 rows x 1 columns]

In [24]:
merged_df["Size"].unique()

array([115.0, nan, 900.0, 5000.0, 60.0, 100.0, 131440.0, 300.0, 70.0,
       496.0, 30.0, 8.0, 80.0, 600.0, 101.0, 170.0, 50.0, 9.0, 2000.0,
       20.0, 140.0, 250.0, 1.0, 104.0, 480.0, 65.0, 850.0, 75.0, 190.0,
       25.0, 230.0, 1000.0, 90.0, 36.0, 3000.0, 40.0, 88.0, 141.0, 550.0,
       200.0, 130.0, 61.0, 380.0, 150.0, 120.0, 123.0, 1234.0, 85.0,
       2500.0, 500.0, 400.0, 185.0, 1200.0, 110.0, 450.0, 10.0, 96.0,
       95.0, 180.0, 188.0, 350.0, 555.0, 113.0, 120000.0, 125.0, 280.0,
       222.0, 54.0, 2.0, 48.0, 56.0, 7000.0, 26.0, 240.0, 160.0, 105.0,
       29.0, 89.0, 2200.0, 11.0, 570.0, 1400.0, 3678.0, 220.0, 335.0,
       1056.0, 580.0, 63.0, 416.0, 620.0, 225.0, 320.0, 76.0, 92.0, 78.0,
       72.0, 122.0, 5607.0, 69.0, 205.0, 51.0, 102.0, 340.0, 57.0, 270.0,
       53.0, 800.0, 82.0, 1100.0, 111.0, 1800.0, 135.0, 360.0, 118.0,
       605.0, 145.0, 157.0, 12.0, 15.0, 28.0, 119.0, 33.0, 35.0, 98.0,
       660.0, 235.0, 62.0, 420.0, 86.0, 45.0, 7.0, 1300.0, 1600.0, 650.0,
       11116.0, 195.0, 330.0, 368.0, 700.0, 460.0, 51515.0, 17.0, 91.0,
       68.0, 210.0, 6.0, 16.0, 99.0, 83.0, 426.0, 418.0, 750.0, 165.0,
       131.0, 306.0, 32.0, 142.0, 215.0, 18.0, 310.0, 39.0, 559.0, 58.0,
       44.0, 192.0, 333.0, 23.0, 275.0, 1780.0, 404.0, 175.0, 21.0, 288.0,
       46.0, 1500.0, 116.0, 55.0, 153.0, 5.0, 396.0, 540.0, 445.0, 4.0,
       425.0, 193.0, 640.0, 64.0, 24.0, 375.0, 98987504.0, 3.0, 720.0,
       132.0, 103.0, 2147483647.0, 351.0, 421.0, 173.0, 111111.0, 71.0,
       703.0, 999.0, 146.0, 74.0, 1111.0, 161.0, 14.0, 79.0, 41.0, 325.0,
       290.0, 676.0, 112.0, 1180.0, 312.0, 206.0, 258.0, 234.0, 43.0,
       684.0, 840.0, 390.0, 344.0, 1000000.0, 244.0, 20000.0, 345.0,
       155.0, 429.0, 133.0, 94.0, 25555.0, 999999.0, 607.0, 10002.0,
       182.0, 246.0, 353.0, 292.0, 42.0, 77.0, 262.0, 93.0, 347.0, 318.0,
       260.0, 352.0, 950.0, 708.0, 187.0, 121.0, 107.0, 624.0, 295.0,
       52.0, 128.0, 159.0, 194.0, 304.0, 358.0, 1080.0, 22222.0, 534.0,
       1150.0, 443.0, 47.0, 22.0, 490.0, 2020.0, 252.0, 688.0, 2888.0,
       100000000.0, 4000.0, 38.0, 770.0, 245.0, 97.0, 52885.0, 298.0,
       99999.0, 283.0, 37.0, 139.0, 790.0, 1217.0, 49.0, 1110.0, 204.0,
       470.0, 121212.0, 158.0, 108.0, 66.0, 354.0, 5000000.0, 212.0,
       22000.0, 151.0, 767.0, 127.0, 355.0, 1365.0, 451.0, 680.0, 1250.0,
       254.0, 276.0, 257.0, 530.0, 228.0, 525.0, 331.0, 289.0, 8000.0,
       754.0, 317.0, 515.0, 2076.0, 73.0, 666.0, 101111111.0, 285.0,
       277.0, 111000.0, 12346.0, 5055555.0, 279.0, 117.0, 670.0, 126.0,
       280000.0, 14000.0, 1555.0, 430.0, 10000.0, 405.0, 440.0, 412.0,
       256.0, 46545.0, 2176.0, 1900.0, 909.0, 27.0, 144.0, 61111.0,
       40668.0, 1155.0, 390000.0, 2085.0, 385.0, 920.0, 560.0, 100000.0,
       463.0, 31.0, 201.0, 1222.0, 6009.0, 346.0, 13000.0, 890.0, 183.0,
       531.0, 915.0, 114.0, 5085.0, 1776.0, 10111.0, 314.0, 370.0, 2592.0,
       1200000.0, 327.0, 2400.0, 512.0, 87.0, 3500.0, 186.0, '65', '39',
       '51.63', '1255', '200', '55', '300', '415', '150', '250', '600',
       '175', '583', '84', '143', '++135', '1400', '97', '++260', '1000',
       '739', '529', '556', '780.42', '172', '82', '++350', '416', '750',
       '94 / 72', '135', '350', '+-130', '+-80', '5000', '47.5', '+-350',
       '120', '100', '32', '290', '370', '+-85', '+-300', '+-155.3', '75',
       '17.5', '170', '+-340', '+-400'], dtype=object)

In [25]:
# Step 1: Convert to string
merged_df["Size"] = merged_df["Size"].astype(str)

# Step 2: Clean each value
merged_df["Size"] = (
    merged_df["Size"]
    .str.strip()                            # Remove leading/trailing spaces
    .str.split("/").str[0]                  # Take first part if there's a "/"
    .str.replace(r"[^\d.]", "", regex=True) # Remove all non-numeric characters except dot
)

# Step 3: Convert to float
merged_df["Size"] = pd.to_numeric(merged_df["Size"], errors="coerce")

# Step 4: Fill nulls with mode
mode_value = merged_df["Size"].mode()[0]
merged_df["Size"] = merged_df["Size"].fillna(mode_value)

In [26]:
merged_df.isnull().sum()

Property Title    0
Location          0
Bedrooms          0
Price             0
Size              0
Listing Type      0
dtype: int64

In [27]:
merged_df[["Size"]]

        Size
0      115.0
1      100.0
2      900.0
3     5000.0
4       60.0
...      ...
5561   170.0
5562   340.0
5563   350.0
5564   100.0
5565   400.0

[4176 rows x 1 columns]

In [28]:
merged_df.shape

(4176, 6)

In [29]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4176 entries, 0 to 5565
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Property Title  4176 non-null   object
 1   Location        4176 non-null   object
 2   Bedrooms        4176 non-null   int32
 3   Price           4176 non-null   float64
 4   Size            4176 non-null   float64
 5   Listing Type    4176 non-null   object
dtypes: float64(2), int32(1), object(3)
memory usage: 212.1+ KB

In [31]:
merged_df.to_csv("RealEstate_Dataset [Cleaned].csv",index = False)